foamCases/3D_LES_particles/partDownstrComb/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    mouth
    {
        type            fixedValue;
        value           uniform (0 2 0);
    }
    person
    {
        type            noSlip;
    }
    nostrils
    {
        type            noSlip;
    }
    wall
    {
        type            noSlip;
    }
    atmos
    {
        type            noSlip;
    }
    atmosEnd
    {
        type            zeroGradient;
    }
    iFaceDownstream
    {
        type            zeroGradient;
    }
    iFaceUpstream
    {
        type            zeroGradient;
    }
    iFaceDownCube
    {
        type            zeroGradient;
    }
    iFaceCube
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //