foamCases/3D_LES_particles/partDownstrComb/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    mouth
    {
        type            zeroGradient;
    }
    person
    {
        type            zeroGradient;
    }
    nostrils
    {
        type            zeroGradient;
    }
    wall
    {
        type            zeroGradient;
    }
    atmos
    {
        type            zeroGradient;
    }
    atmosEnd
    {
        type            fixedValue;
        value           uniform 0;
    }
    iFaceDownstream
    {
        type            zeroGradient;
    }
    iFaceUpstream
    {
        type            zeroGradient;
    }
    iFaceDownCube
    {
        type            zeroGradient;
    }
    iFaceCube
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
